Revit 2024 API
FabricSheetType.MajorLayoutPattern Property
 The layout pattern in the major direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public FabricSheetLayoutPattern MajorLayoutPattern { get; }
Visual Basic
Public ReadOnly Property MajorLayoutPattern As FabricSheetLayoutPattern
	Get
Visual C++
public:
property FabricSheetLayoutPattern MajorLayoutPattern {
	FabricSheetLayoutPattern get ();
}
See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace